# Universal — installed on every machine.
# Shell, editor, terminal, git, AI tools, security, password manager.

# --- CLI tools ---
brew "ack"
brew "chezmoi"
brew "dos2unix"
brew "gemini-cli"
brew "gh"
brew "git-lfs"
brew "git-mob"
brew "git-xargs"
brew "gitleaks"
brew "graphviz"
brew "jq"
brew "lftp"
brew "mas"
brew "nmap"
brew "pnpm"
brew "powerlevel10k"
brew "uv"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# --- Apps ---
cask "1password"
cask "1password-cli"
cask "antigravity"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "codex"
cask "cursor"
cask "ghostty"
cask "jetbrains-toolbox"
cask "logi-options+"
cask "maccy"
cask "notion"
cask "postman"
cask "rectangle"
cask "spotify"
cask "visual-studio-code"
cask "whatsapp"

# --- VSCode extensions (editor/language-agnostic baseline) ---
vscode "anthropic.claude-code"
vscode "ban.spellright"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "mechatroner.rainbow-csv"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "timonwong.shellcheck"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
vscode "johnpapa.vscode-peacock"
vscode "johnpapa.winteriscoming"

# --- Python (cross-cutting) ---
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.debugpy"
vscode "ms-python.autopep8"
vscode "ms-python.flake8"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"

# --- Remote dev ---
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.makefile-tools"
