tap "buildpacks/tap"
brew "ack"
brew "circleci"
brew "colima"
brew "docker-completion"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "dos2unix"
brew "dotnet@8"
brew "gemini-cli"
brew "gh"
brew "git-mob"
brew "git-xargs"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "graphviz"
brew "helm"
brew "influxdb@1", restart_service: :changed
brew "jmeter"
brew "k9s"
brew "kubernetes-cli"
brew "lftp"
brew "mage"
brew "nmap"
brew "pinentry-mac"
brew "pnpm"
brew "podman"
brew "powerlevel10k"
brew "sops"
brew "tfenv"
brew "uv"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "buildpacks/tap/pack"
cask "antigravity"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "cloudflare-warp"
cask "codex"
cask "cursor"
cask "cursor-cli"
cask "dotnet-sdk@8"
cask "gcloud-cli"
cask "ghostty"
cask "gpg-suite"
cask "jetbrains-toolbox"
cask "logi-options+"
cask "maccy"
cask "memoryanalyzer"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-teams"
cask "mongodb-compass"
cask "notion"
cask "postman"
cask "rectangle"
cask "spotify"
cask "visual-studio-code"
cask "whatsapp"
vscode "4ops.terraform"
vscode "angular.ng-template"
vscode "anthropic.claude-code"
vscode "ban.spellright"
vscode "bradlc.vscode-tailwindcss"
vscode "circleci.circleci"
vscode "datadog.datadog-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "dcortes92.freemarker"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "jcanero.hoogle-vscode"
vscode "johnpapa.angular-essentials"
vscode "johnpapa.angular2"
vscode "johnpapa.vscode-peacock"
vscode "johnpapa.winteriscoming"
vscode "justusadam.language-haskell"
vscode "leizongmin.node-module-intellisense"
vscode "lunaryorn.hlint"
vscode "maxgabriel.brittany"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-modernize"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "nrwl.angular-console"
vscode "openai.chatgpt"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "steoates.autoimport"
vscode "timonwong.shellcheck"
vscode "vans.haskero"
vscode "vitest.explorer"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
vscode "wizcloud.wiz-vscode"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
